In [ ]:
Create a series named heights_A with values 176.2, 158.4, 167.6, 156.2, and 161.4. 
These values represent heights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Create another series named weights_A with values 85.1, 90.2, 76.8, 80.4, and 78.9. 
These values represent weights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Create a dataframe named df_A, which holds the height and weight of five students s1, s2, s3, s4 and s5.

Label the columns as Student_height and Student_weight, respectively.

Add a new column Gender to the dataframe df_A with values ['M', 'F', 'M', 'M', 'F'].

Create another Series s, from a list [165.4, 82.7, 'F'].

Provide the following values to the argument index: ['Student_height', 'Student_weight', 'Gender']

Set the value of the name argument of series, s, to s6.

Append the series s to the dataframe df_A, and store the captured array in df_AA.

Display the dataframe df_AA.

In [29]:
import pandas as pd
import numpy as np
heights_A = pd.Series([176.2, 158.4, 167.6, 156.2, 161.4], index=['s1', 's2', 's3', 's4', 's5'])
weights_A = pd.Series([85.1, 90.2, 76.8, 80.4, 78.9], index=['s1', 's2', 's3', 's4', 's5'])
df_A = pd.DataFrame()
df_A['Student_height'] = heights_A
df_A['Student_weight'] = weights_A
df_A['Gender'] = ['M', 'F', 'M', 'M', 'F']
s = pd.Series([165.4, 82.7, 'F'],index=['Student_height', 'Student_weight', 'Gender'])
df_A.loc['s6']=s
df_AA=df_A
print(df_AA)

    Student_height  Student_weight Gender
s1           176.2            85.1      M
s2           158.4            90.2      F
s3           167.6            76.8      M
s4           156.2            80.4      M
s5           161.4            78.9      F
s6           165.4            82.7      F

In [4]:
s = pd.Series([165.4, 82.7, 'F'],index=['Student_height', 'Student_weight', 'Gender'])

In [8]:
s

Student_height    165.4
Student_weight     82.7
Gender                F
dtype: object

In [21]:
df_A.drop('s6',axis=1,inplace=True)

In [24]:
df_A.loc['s6']=s

In [28]:
df_AA=df_A
print(df_AA)

    Student_height  Student_weight Gender
s1           176.2            85.1      M
s2           158.4            90.2      F
s3           167.6            76.8      M
s4           156.2            80.4      M
s5           161.4            78.9      F
s6           165.4            82.7      F

In [30]:
Create another Series named heights_B from a 1-D numpy array of 5 elements derived from the normal
distribution of mean 170.0 and standard deviation 25.0.
Note: Set random seed to 100 before creating heights_B series. Note: 
        Set random seed to 100 before creating weights_B series.

Create another Series named weights_B from a 1-D numpy array of 5 elements derived 
from the normal distribution of mean 75.0 and standard deviation 12.0.

Label both Series elements as s1, s2, s3, s4 and s5.

Create a dataframe df_B containing the height and weight of students s1, s2, s3, s4 and s5 belonging to class B.

Label the columns as Student_height and Student_weight respectively.

Change the index of df_B to [ 's7', 's8', 's9', 's10', 's11'].

Create the Gender column in df_B with values ['F', 'M', 'F', 'F', 'M'].
Concatenate two dataframes df_AA and df_B, and assign the result to df. Note: Use the concat method of pandas.
Display the dataframe df.

SyntaxError: invalid syntax (<ipython-input-30-9e6f1f81330d>, line 1)

In [46]:
import numpy as np
import pandas as pd
np.random.seed(100)
heights_B=pd.Series(np.random.normal(170,25,5), index=['s1', 's2', 's3', 's4', 's5'])
np.random.seed(100)
weights_B=pd.Series(np.random.normal(75,12,5),index=['s1', 's2', 's3', 's4', 's5'])
df_B=pd.DataFrame()
df_B['Student_height'] = heights_B
df_B['Student_weight'] = weights_B
df_B.index = [ 's7', 's8', 's9', 's10', 's11']
df_B['Gender'] = ['F', 'M', 'F', 'F', 'M']
df = pd.concat([df_AA,df_B])
print(df)

     Student_height  Student_weight Gender
s1       176.200000       85.100000      M
s2       158.400000       90.200000      F
s3       167.600000       76.800000      M
s4       156.200000       80.400000      M
s5       161.400000       78.900000      F
s6       165.400000       82.700000      F
s7       126.255863       54.002814      F
s8       178.567010       79.112165      M
s9       198.825895       88.836430      F
s10      163.689099       71.970768      F
s11      194.533020       86.775849      M

In [36]:
df_B.index = [ 's7', 's8', 's9', 's10', 's11']

In [38]:
df_B['Gender'] = ['F', 'M', 'F', 'F', 'M']

In [42]:
df_B
df_AA

    Student_height  Student_weight Gender
s1           176.2            85.1      M
s2           158.4            90.2      F
s3           167.6            76.8      M
s4           156.2            80.4      M
s5           161.4            78.9      F
s6           165.4            82.7      F

In [43]:
pd.concat([df_AA,df_B])

     Student_height  Student_weight Gender
s1       176.200000       85.100000      M
s2       158.400000       90.200000      F
s3       167.600000       76.800000      M
s4       156.200000       80.400000      M
s5       161.400000       78.900000      F
s6       165.400000       82.700000      F
s7       126.255863       54.002814      F
s8       178.567010       79.112165      M
s9       198.825895       88.836430      F
s10      163.689099       71.970768      F
s11      194.533020       86.775849      M

In [ ]:
Create the following two Series: nameid = pd.Series(range(101, 111))

name = pd.Series(['person' + str(i) for i in range(1, 11)])

Create the dataframe master with series nameid and name. Let the column names be nameid and name respectively.

Create the dataframe transaction using the command: 
    transaction = pd.DataFrame({'nameid':[108, 108, 108,103], 'product':['iPhone', 'Nokia', 'Micromax', 'Vivo']})

Merge master with transaction on nameid, and save the merged dataframe as mdf. Perform inner join. Note: Use the merge method.

Display mdf.

In [58]:
import pandas as pd
nameid = pd.Series(range(101, 111))
name = pd.Series(['person' + str(i) for i in range(1, 11)])
master = pd.DataFrame()
master['nameid'] = nameid
master['name'] = name
transaction = pd.DataFrame({'nameid':[108, 108, 108,103], 'product':['iPhone', 'Nokia', 'Micromax', 'Vivo']})
mdf = pd.merge(master,transaction, on='nameid')
print(mdf)

   nameid     name   product
0     103  person3      Vivo
1     108  person8    iPhone
2     108  person8     Nokia
3     108  person8  Micromax

   nameid     name   product
0     103  person3      Vivo
1     108  person8    iPhone
2     108  person8     Nokia
3     108  person8  Micromax

In [59]:
import pandas as pd

s1 = pd.Series([0, 1, 2, 3])
s2 = pd.Series([0, 1, 2, 3])
s3 = pd.Series([0, 1, 4, 5])
d = pd.concat([s1, s2, s3], axis=1)

In [60]:
d.shape

(4, 3)

In [61]:
import pandas as pd

df = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])

In [66]:
df.iloc[:2]
df.iloc[1]

A    78
B    67
Name: r2, dtype: int64

In [67]:
df.B

r1    12
r2    67
r3    43
Name: B, dtype: int64

In [68]:
df[lambda x : x.index.str.endswith('3')]

     A   B
r3  54  43

In [69]:
len(pd.period_range('11-Sep-2017', '17-Sep-2017', freq='M'))

1

In [70]:
 g = df.groupby(df.index.str.len())
g.filter(lambda x: len(x) > 1)

     A   B
r1  34  12
r2  78  67
r3  54  43

In [74]:
df.loc[df.B > 45]

     A   B
r2  78  67

In [77]:
df=pd.DataFrame(np.random.randn(10), index=[ 'r1', 'r2', 'r3', 'row4', 'row5', 'row6', 'r7', 'r8', 'r9', 'row10'])

In [87]:
 g = df.groupby(df.index.str.len())
g.filter(lambda x: len(x) > 1)
for i in g:
    print(i)

(2,            0
r1  0.937082
r2  0.731000
r3  1.361556
r7 -1.443217
r8 -0.756352
r9  0.816454)
(4,              0
row4 -0.326238
row5  0.055676
row6  0.222400)
(5,               0
row10  0.750445)